app/controllers/posts_controller.rb

  def update
    @post = Post.find(params[:id])
    @post.update(params.require(:post))
---
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 7]]
UPDATE "posts" SET "description" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["description", "what did I say, I typically like a 4th post myself"], ["updated_at", "2018-04-19 19:48:41.992329"], ["id", 19]]